app/controllers/api/v1/favorites_controller.rb

    def index
        favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def show
        favorite = Favorite.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        favorite = Favorite.create!(favorite_params)
---
INSERT INTO "favorites" ("user_id", "studio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["studio_id", 48], ["created_at", "2020-10-12 19:24:47.318232"], ["updated_at", "2020-10-12 19:24:47.318232"]]

    def destroy
        favorite = Favorite.find(params[:id])
        favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 12]]