app/controllers/api/v1/studios_controller.rb

    def index
        studios = Studio.all.sort_by {  |studio| studio.name  }
---
SELECT "studios".* FROM "studios"

    def create
        studio = Studio.create!(studio_params)
---
INSERT INTO "studios" ("name", "address", "contact", "image", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        studio = Studio.find(params[:id])
---
SELECT "studios".* FROM "studios" WHERE "studios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]